{
    "id": 1,
    "title": "ٱلْأَخِلَّآءُ يَوْمَئِذٍۭ بَعْضُهُمْ لِبَعْضٍ عَدُوٌّ إِلَّا ٱلْمُتَّقِينَ",
    "content": "Verse 67\n\n**Translation (English):** On that Day, friends will be enemies of one another, except for the righteous.\n\n**Translation (Urdu):** (جو آپس میں) دوست (ہیں) اس روز ایک دوسرے کے دشمن ہوں گے۔ مگر پرہیزگار (کہ باہم دوست ہی رہیں گے)\n\n**Select Tafsir Language:** English (Ibn Kathir)\n\n**Tafsir for Verse 67:**\n\nThe Resurrection will come suddenly, and enmity will arise between close friends among the disbelievers. Allah says, 'Do these idolaters who disbelieve in the Messengers wait إِلاَّ السَّاعَةَ أَن تَأْتِيَهُمْ بَغْتَةً وَهُمْ لاَ يَشْعُرُونَ (only for the Hour that it shall come upon them suddenly while they perceive not)?' It means the Hour is real and will inevitably come to pass, and these negligent people are unprepared for it. When it comes, it will catch them unawares. On that Day, they will feel utmost regret, but regret will not benefit them.\n\nالآخِلاَءُ يَوْمَئِذٍ بَعْضُهُمْ لِبَعْضٍ عَدُوٌّ إِلاَّ الْمُتَّقِينَ (Friends on that Day will be foes one to another except those who have Taqwa.) Every friendship existing for a purpose other than for the sake of Allah will turn to enmity on the Day of Resurrection, except that which is for the sake of Allah, which will last forever.\n\n**Good News for Those with Taqwa on the Day of Resurrection, and Their Entry into Paradise:**\n- My servants! No fear shall be on you this Day, nor shall you grieve.\n- Those who believed in Our Ayat and were Muslims will hear the glad tidings: 'Enter Paradise, you and your spouses, in happiness.'\n- Trays of gold and cups will be passed round them, containing whatever they desire. The righteous will live there forever.\n\n**Conclusion:**\nThis verse emphasizes that only righteous relationships—those based on piety and for the sake of Allah—will endure, providing hope and guidance for believers. It also underscores the transient nature of worldly bonds outside of faith."
}
