{
  "id": 1,
  "title": "ٱلْأَخِلَّآءُ يَوْمَئِذٍۭ بَعْضُهُمْ لِبَعْضٍ عَدُوٌّ إِلَّا ٱلْمُتَّقِينَ",
  "content": {
    "verse": 67,
    "translation": {
      "english": "On that Day, friends will be enemies of one another, except for the righteous.",
      "urdu": "جو آپس میں دوست ہیں اس روز ایک دوسرے کے دشمن ہوں گے۔ مگر پرہیزگار (کہ باہم دوست ہی رہیں گے)"
    },
    "tafsir": {
      "language": "English (Ibn Kathir)",
      "details": [
        "The Resurrection will come suddenly, and enmity will arise between close friends among the disbelievers. Allah says, 'Do these idolaters who disbelieve in the Messengers wait for the Hour that it shall come upon them suddenly while they perceive not?' This means that it is real and will inevitably come to pass, catching these negligent people unprepared. On that Day, they will feel the utmost regret when regret will no longer benefit them.",
        "'Friends on that Day will be foes one to another except those who have Taqwa.' Every friendship that exists for a purpose other than for the sake of Allah will turn into enmity on the Day of Resurrection, except for those friendships formed for the sake of Allah, which will last forever. This is similar to Prophet Ibrahim's statement: 'You have taken idols instead of Allah. The love between you is only in the life of this world, but on the Day of Resurrection, you shall disown each other and curse each other. Your abode will be the Fire, and you shall have no helper.' (29:25)"
      ]
    },
    "good_news": {
      "for_taqwa": [
        "'My servants! No fear shall be on you this Day, nor shall you grieve.' This glad tiding is for those who believed in Allah’s Ayat and submitted to His Laws both inwardly and outwardly. On that Day, everyone will be filled with terror except the believers."
      ],
      "entry_to_paradise": [
        "'Enter Paradise, you and your wives, in happiness.' There will be joy and delight, with fine vessels of gold containing food and drink. Paradise will have everything the soul desires and the eyes delight in. They will remain in Paradise forever, inheriting it due to their deeds done with Allah’s grace and mercy."
      ],
      "additional_details": [
        "'Therein for you will be fruits in plenty, of which you will eat.' This signifies the completion of blessings and joy with food, drink, and fruits of all kinds."
      ]
    }
  }
}
